/* В данных задачах старайтесь не использовать методы массивов. Используйте циклы и условия.

Вопросы к этому заданию
На основе строки “i am in the easycode” сделать новую строку где первые буквы каждого слова
будут в верхнем регистре. Использовать for или while.
*/

/* let str = 'i am in the easycode'
let strUp = ''
for (let i = 0; i < str.length; i++) {
  if (i === 0 || str[i-1] == ' ') {
    strUp += str[i].toUpperCase()
  } else {
    strUp += str[i]
  }
}
console.log(strUp) */
/* _______________________________________________________________________________ */


/* Дана строка “tseb eht ma i”. Используя циклы, сделать строку-перевертыш (то есть последняя буква становится первой, предпоследняя - второй итд). */

/* let naob = 'tseb eht ma i'
let boan = ''
for (let i = naob.length; i--;) {
  boan += naob[i]
}
console.log(boan)
/* ________________________________________________________________________________ */

/* Факториал числа - произведение всех натуральных чисел от 1 до n включительно: 3! = 3*2*1, 5! = 5*4*3*2*1. С помощью циклов вычислить факториал числа 10. Использовать for.
 */
/* let num = 1
for (i = 1; i <= 10; i++) {
  num *= i
}
console.log(num) */
/* _____________________________________________________________________________________ */

/* На основе строки “JavaScript is a pretty good language” сделать новую строку,
где каждое слово начинается с большой буквы, а пробелы удалены. Использовать for. */
/* let str = 'JavaScript is a pretty good language'
let strNo = ''
for (let i = 0; i < str.length; i++) {
  if (str === 0 || str[i-1] == ' ') {
    strNo += str[i].toUpperCase()
  } else if (str[i] !== ' '){
    strNo += str[i]
  }
}
console.log(strNo) */
/* _____________________________________________________________________________________ */

/* Найти все нечетные числа в массиве от 1 до 15 включительно и вывести их в консоль. Массив [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15] Использовать for of. */

/* let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
for (let value of arr) { 
  if (value % 2) {
    console.log(value)
  }
} */
/* ____________________________________________________________________________________ */

/* Дан объект:
let list = {
name: ‘denis’,
work: ‘easycode’,
age: 29
}
Перебрать объект и если значение в свойстве это строка то переписать ее всю в верхнем регистре. Использовать for in. */

/* let list = {
  name: 'Baha',
  work: 'easycode',
  age: 29
}

for (let key in list) {
  if (typeof list[key] === 'string') {
    list[key] = list[key].toUpperCase() 
  }
  console.log(list[key])
}
console.log(list) */
/* ____________________________________________________________________________________ */

// РАЗОБРАТЬСЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
/* let arr = [2, 3, 5, 8, 9]
arr[300] = 1
console.log(arr.length); */
